Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh686-v3.tmx
Source language: bo
Languages: en

source: །ཀུན་ཀྱང་མེ་དབུས་འཇིགས་པ་མེད། །དཀྱིལ་འཁོར་དབུས་སུ་དགོད་པ་བཞིན།
en: All of them should portrayed surrounded by flames and fearless. “

source: །ཕྱི་རོལ་ཐིག་ལེ་པདྨོའི་ཕྲེང་། །རྡོ་རྗེ་རྩེ་གསུམ་གཞག་པ་ནི། །ཀུན་ཏུ་འབར་བ་ཕྲེང་བར་བཅས། །ཕྱི་རོལ་དཀྱིལ་འཁོར་ཀུན་ཏུ་ནི། །བྲི་བྱ་རྟག་དང་ཕྱག་རྒྱ་དང་།
en: Outside of this inner maṇḍala, he should draw additional concentric lines of lotuses, vajras, and tridents, all surrounded by a garland of flames.

source: །ལྷ་ནི་དབང་ཕྱུག་དབང་ཕྱུག་ཆེ། །ཚངས་པ་ཁྱབ་འཇུག་གཤིན་རྗེ་དང་། །ཆུ་ལྷ་དབང་པོ་ལུས་ངན་པོ། །དབང་སྒྱུར་དགའ་ལྡན་གནས་དག་གི། །ལྷ་ནས་འོག་མིན་གནས་ཀྱི་བར།
en: In the outer ring he should draw the emblems and insignia of the deities Īśvara, Maheśvara, Brahmā, Viṣṇu, Maheśvara, Yama, Varuṇa, Indra, Kumāra, and the gods of the Vaśavartin, Tuṣita, and other realms as far as Akaniṣṭha.

source: །ལྷ་རྣམས་བྲི་བར་བྱ་བ་ཡིན། །སུམ་ཅུ་རྩ་གསུམ་ལྷ་རྣམས་དང་། །རྟགས་ནི་རྣམ་པ་སྣ་ཚོགས་དང་། །ཀུན་ཀྱང་པདྨོའི་གདན་ལ་གནས། །དེ་བཞིན་ཆོས་ཀྱི་འཁོར་ལོ་དང་། །རྡོ་རྗེ་རྩེ་ལྔ་རྡོ་རྗེ་དང་། །ཞགས་པ་དང་ནི་དགྲ་སྟ་དང་། །ལེགས་མཐོང་འཁོར་ལོ་དེ་བཞིན་ནོ། །མདུང་རྩེ་གསུམ་དང་པཊྚི་ས། །ངོས་ལ་དབྱུག་པ་ཐོ་བ་དང་། །རྡོ་རྗེ་དཀྱིལ་འཁོར་པདྨའི་ཕྲེང་། །འཁོར་ལོ་དུང་དང་ག་དཱ་དང་། །རལ་གྲི་དང་ནི་ཏོ་མ་རཾ། །བུམ་པ་གང་བ་དག་དང་ནི། །མི་སྣང་བ་ཡི་འབག་ཤ་དང་།
en: He should also draw the various emblems of the gods from the realm of Thirty-Three, each upon a lotus seat.

source: །པདྨ་དང་ནི་ཨུཏྤ་ལ། །རྒྱལ་མཚན་གདུགས་དང་ནོར་བུ་དང་། །དབྱུག་པ་དང་ནི་རྡོ་རྗེ་དང་། །གྲ་བཞིར་རྡོ་རྗེས་མཚན་པ་ཡིན། །ནོར་བུ་རྡོ་རྗེ་དག་དང་ནི། །དགྲ་སྟ་རྡོ་རྗེ་དག་དང་ནི། །ཕྱག་རྒྱ་བཞི་དང་དགའ་བ་འཁྱིལ། །བྱ་མ་བུམ་དང་ཀུན་དི་དང་། །རིལ་བ་བྷྲྀང་ག་རི་དང་ནི། །རི་དགས་ཨེ་ནའི་པགས་པ་དང་། །མཆོད་ཕྱིར་ཐོགས་པའི་སྣམ་བུ་དང་།
en: These emblems are a dharma wheel, vajra, five-pointed vajra, noose, axe, discus, trident, three-pointed spear, tiryagdaṇḍa, hammer, vajra discus, garland of lotuses, discus, conch, mace, sword, javelin, full jar, mirror, purse, lotus, blue lotus, banner, parasol, jewel staff, vajra-square marked with vajras, jewel vajra, and axe vajra, the four seals, a nandikāvarta,khara, pot, and vase, and the skin of a black antelope, a sacred thread, and a paṭala.

source: །སྟེང་དུ་རྒྱུ་སྐར་བཅས་པ་ཡི། །ཟླ་བ་ཉི་མ་དེ་བཞིན་ནོ། །ཀུན་ཀྱང་འབར་བའི་ནང་དུ་འདུག །སོ་སོར་ཆ་ནི་དབྱེ་བར་བྱ།
en: Further out, he should draw the nakṣatras, the moon, and the sun, all blazing with light and distinguished by their different colors. “

source: །མཁས་པས་ཤར་གྱི་སྒོར་བྲི་བ། །འགྱིང་བག་མཐོང་ན་འཇིགས་སུ་རུང་། །ལག་ན་རྡོ་རྗེ་འཇིགས་པ་མེད།
en: At the eastern gate, the wise vidyā holder should skillfully draw the fearless Vajrapāṇi, looking fierce and standing with his feet apart.

source: །རྡོ་རྗེ་འཆང་བ་འབར་བའི་ནང་། །ཀི་ལི་ཀི་ལ་གཏུམ་པོ་ཆེ།
en: He holds a vajra and is surrounded with light.

source: །ལྷོ་ཕྱོགས་ཀྱི་ནི་སྒོ་རུ་གཞག །ནུབ་ཏུ་རྡོ་རྗེ་པིང་ག་ལ། །མཐོང་ན་འཇིགས་སུ་རུང་བ་ཡི། །བྱང་དུ་ངེས་པར་གནོད་མཛེས་བྱ།
en: At the southern gate, he should draw the terrible Kelikila, at the western gate Vajrapiṅgala, and at the northern gate the fierce looking Nisumbha.

source: །ཕྱི་རོལ་དཀྱིལ་འཁོར་ཀུན་ཏུ་ནི། །པདྨའི་ཕྲེང་དང་ཨུཏྤལ་ཕྲེང་། །གྲྭ་དག་དང་ནི་གྲྭ་རྣམས་སུ། །ཀླུ་ཡི་རྒྱལ་པོ་བཞི་རྣམས་བྲི།
en: He should draw a garland of pink and blue lotuses surrounding the outside the maṇḍala, with the four lordly elephants in the four corners.

source: །སྒོ་སྲུང་བ་དག་བྲི་བ་ནི། །ནོར་བུ་བཟང་དང་གང་བ་བཟང་། །སྟོབས་ཀྱི་ལྷ་དང་ལྔས་རྩེན་ཡིན། །སྒོ་ཡི་གནས་ཀྱི་བར་དག་ཏུ། །ཆུ་བོ་བཞི་ནི་བྲི་བྱ་བ། །གང་གཱ་དང་ནི་སི་ཏ་དང་། །པཀྵུ་དང་ནི་སིནྡུ་ཡིན། །ཕྲེང་བའི་ནང་རོལ་ཐོག་དག་ཏུ། །དཔལ་གྱི་ལྷ་མོ་བ་སན་ཏཱི། །དཔེ་མེད་མ་དང་ས་ཡི་ལྷ།
en: He should draw the four gatekeepers—Maṇibhadra, Pūrṇabhadra, Baladeva, and Pāñcika—standing next to the gates, as well as the four great rivers, Gaṅgā, Sītā, Vakṣā, and Candrabhāgā.

source: །ལོ་ཏོག་སྨན་གྱི་ལྷ་མོ་དང་། །སྒྲ་དབྱངས་མ་དང་འཇིགས་ལྡན་མ། །དེ་བཞིན་མི་ཡི་ལྷ་དག་དང་། །འཕྲོག་མ་དང་ནི་དུང་ཅན་མ། །གཏུམ་མོ་དང་ནི་མེ་ཏོག་སོ། །དེ་དག་བྲི་བར་བྱ་བ་ཡིན། །ཁྲུས་བྱས་འདྲི་མཁན་གཙང་མ་ཡིས།
en: Inside the garland he should draw the goddesses Śrī, Vāsantī, Anaupamyā, the earth deity, the deity of crops and herbs, Sarasvatī, Bhīmā, the fire deity, Hārītī, Śaṅkhinī, Caṇḍinī, and Puṣpadantī, all in a circle. “

source: །གཙང་མའི་སྣོད་དུ་ཚོན་རྣམས་ནི། །ལྷག་མ་མིན་པས་ཀུན་ཏུ་བྲི། །ཟས་ནི་དཀར་གསུམ་གྲུབ་པར་བྱ། །ཁྱད་པར་འདོད་པས་ཟས་ངན་པ། །སྤང་བར་བྱ་བ་ཉ་དང་ཤ། །བཙོང་དང་སྒོག་སྐྱ་ཀེའུ་རྣམས་དང་། །འདྲེས་པ་སྤང་བར་བྱ་བ་ནི།
en: The painting should be executed using uncontaminated paints in clean containers by a vidyā holder who is a good artist, is ritually pure, subsists on the three ‘white’ foods prepared the right way, and avoids any food that is improper, in particular wine, meat, onions, garlic, red onions, or any combinations thereof.

source: །ལོག་འདྲེན་གླགས་ཚོལ་སྤང་ཕྱིར་རོ།
en: These are the precautions necessary to prevent the vināyakas from causing harm.

source: །ཁྲུས་བྱས་གོས་ནི་སར་པ་བགོས། །གཙང་མས་དཀྱིལ་འཁོར་བྲི་བར་བྱ།
en: He should purify himself ritually, bathe, and put on clean clothes.

source: །དཀྱིལ་འཁོར་རྣམ་པ་སྣ་ཚོགས་ཀྱིས། །ཀུན་ཏུ་བརྒྱན་བར་བྱ་བ་ནི། །བ་དན་རྣམ་པ་སྣ་ཚོགས་དང་། །རྣམ་པ་སྣ་ཚོགས་མདའ་དང་ནི། །ལྷ་རྫས་དར་ནི་དཔྱང་བ་དང་།
en: He should brightly adorn the maṇḍala in various ways with an assortment of banners and arrows, hang divine silk streamers, and raise banners.

source: །བ་དན་ཡང་ནི་དཔྱང་བར་བྱ། །ཚོན་སྐུད་སྣ་ལྔའི་སྲད་བུ་ཡིས། །ཀུན་ཏུ་ཡོངས་སུ་བསྐོར་བར་བྱ།
en: He should surround everything with a five-colored thread. “

source: །ཟངས་ལས་བྱས་པའི་པདྨའི་ཚད། །སོར་བཞི་འདབ་མ་བྱེ་བ་དེ། །མཛེས་པ་གྲྭ་བཞིར་གཟུགས་པར་བྱ། །སྙིང་པོ་དཀྱིལ་འཁོར་གྲྭ་རྣམས་སུ།
en: The vidyā holder should then procure four copper lotuses, each four fingers wide and adorned with petals, and stick them in the ground at the four corners.

source: །པདྨ་བརྒྱད་ནི་གཞལ་བ་དག །གསེར་ལས་བྱས་པ་བཞི་གཞག་ཅིང་། །དེ་བཞིན་དངུལ་ལས་བྱས་པ་བཞི། །ཀུན་ཏུ་བྱི་རུའི་ཕྲེང་བ་དང་། །མུ་ཏིག་ཕྲེང་བ་དེ་བཞིན་ནོ། །ཀུན་ཏུ་གསེར་གྱི་སྲང་བུ་དང་།
en: He should add another eight lotuses, four of them golden and four silver, and surround them with strings of coral, pearls, and gold.

source: །རིན་ཆེན་སྣ་ཚོགས་གཞག་པར་བྱ། །སྙིང་པོའི་དཀྱིལ་འཁོར་ཐིག་བར་དུ། །གསེར་གྱི་སྣོད་ནི་བཞི་དག་དང་། །དངུལ་གྱི་སྣོད་ནི་བཞི་གཞག་གོ།
en: He should place various jewels all around it.

source: །དངུལ་གྱི་བུམ་པ་གང་བ་བཞི་ལ་དངུལ་དང་། གསེར་དང་། ཟངས་ལས་བྱས་པའི་མེ་ཏོག་སྤྲས་པའི་མགོ་ལྕོགས་ཀྱིས་སྤྲས་པ་གཞག་པར་བྱའོ། །གསེར་གྱི་བུམ་པ་བཞི་གཞག་པ་ལ་མུ་ཏིག་དང་། བྱི་རུ་དང་། པདྨ་རཱ་ག་དང་། མ་རྒད་དང་།
en: Inside, within concentric zones, he should arrange rows with four golden dishes, four silver dishes, four jars filled with silver that are decorated with copper, silver, and golden flowers, and four jars filled with gold that are decorated with pearls, corals, rubies, emeralds, sapphires, and silver and golden flowers. “

source: ཨིནྡྲ་ནཱི་ལ་དང་། དངུལ་དང་། གསེར་དང་། མེ་ཏོག་གིས་སྤྲས་པའི་མགོ་ལྕོགས་གཞག་པར་བྱའོ། །གླ་རྩི་དང་། ག་པུར་དང་།
en: He should fill the golden dishes with musk, camphor, saffron, and divine sandalwood powder.

source: གུར་གུམ་དང་། ལྷ་རྫས་ཀྱི་ཙནྡན་གྱི་ཕྱེ་མས་གསེར་གྱི་སྣོད་བཀང་བ་དང་། དངུལ་གྱི་སྣོད་ཀྱི་ནང་དུ་གསེར་གྱི་མེ་ཏོག་དང་། དངུལ་གྱི་མེ་ཏོག་དང་། ཟངས་ཀྱི་མེ་ཏོག་མུ་ཏིག་གིས་བརྒྱན་ཅིང་རིན་པོ་ཆེ་རྣམ་པ་སྣ་ཚོགས་སྤྲས་པ་གཞག་པར་བྱ།
en: On the silver dishes he should place golden flowers, silver flowers, and copper flowers adorned with pearls and encrusted with various jewels.

source: ཅོད་པན་གྱི་རྒྱལ་མཚན་བཞི་གཞག་པར་བྱ། རིན་པོ་ཆེའི་རྒྱལ་མཚན་བཞི་གཞག་པར་བྱ། ཚོན་སྣ་ཚོགས་ཅན་དང་། དར་དམར་པོ་དཔྱང་བར་བྱ།
en: He should install four crest banners and four jewel banners and hang red and multicolored silk streamers.

source: དངུལ་གྱི་པོག་པོར་བཞི་གཞག་སྟེ། ཙནྡན་དང་། གླ་རྩི་དང་། ག་བུར་དང་། གུར་གུམ་གྱི་བདུག་པས་བདུག་པར་བྱ།
en: He should add four silver incense holders and burn incense of sandalwood, musk, camphor, and saffron.

source: ས་ལས་བྱས་པའི་བུམ་པ་གསེར་གྱིས་གཡོགས་པའི་ནང་དུ་དྲི་ཆབ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བཀང་སྟེ། རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པར་བགྱིས་ལ་བཀང་བ་ལ་དར་གྱིས་བཅིངས་ལ་རྒྱན་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བརྒྱན་པའི་སྟེང་དུ་ཟངས་ལས་བྱས་པའི་མེ་ཏོག་བཞག་ནས་སྙིང་པོའི་དཀྱིལ་འཁོར་གྱི་སྟེང་དུ་པདྨའི་སྟེང་དུ་གཞག་པར་བྱའོ། །དེ་ནས་ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་ཐོག་ཐག་ཏུ་དྲི་དང་། ཕྱེ་མ་དང་།
en: He should prepare a clay pot with a gold covering and fill it with water suffused with various strong fragrances, also adding the seven types of jewels. He should tie a piece of clean, pure cloth around the pot, decorate it with various adornments, put it on a copper lotus, and place it upon a lotus, at the center of the maṇḍala. “

source: བྱུག་པ་དང་། མེ་ཏོག་དང་། འབྲས་བུ་ལ་སོགས་པ་རྣམ་པ་སྣ་ཚོགས་དང་། མཆོད་ཡོན་གྱི་ཆབ་ཀྱིས་དངུལ་གྱི་སྣོད་དང་། ཟངས་ཀྱི་སྣོད་བཀང་བ་དྲུག་ཅུ་རྩ་བཞི་གཞག་པར་བྱའོ།
en: All along the outer circle of the maṇḍala, he should place sixty-four silver and copper dishes with various fragrant powders, oils, and flowers, sixty-four full jars made of iron and filled with with various flowers and vines, and sixty-four incense holders in which burn various types of incense.

source: །ལྕགས་ཀྱི་སྣོད་བུམ་པ་གང་བ་དྲུག་ཅུ་རྩ་བཞི་གཞག་པར་བྱའོ། །མེ་ཏོག་དང་། མགོ་ལྕོགས་དང་། པོར་ཕོག་བཀང་བ་དྲུག་ཅུ་རྩ་བཞི་གཞག་པར་བྱའོ། །གཞག་པར་བྱ་སྟེ་བདུག་པ་སྣ་ཚོགས་ཀྱིས་བདུག་པར་བྱའོ།
en: At the four gates he should place iron and copper jars full of scented water and adorned with ornaments and silk streamers.

source: །སྒོ་བཞིར་དྲི་ཆབ་ཀྱི་བུམ་པ་དར་གྱིས་བརྒྱན་ཅིང་སྤུད་པ་གཞག་པར་བྱའོ། །སྣ་མའི་མེ་ཏོག་གི་གདུ་བུའི་སྟེང་དུ་མདའ་ལ་བ་དན་བཏགས་པ་དྲུག་ཅུ་རྩ་བཞི་བཅུགས་ཏེ། ཚོན་སྣ་ཚོགས་ཀྱིས་བཀྲ་བར་བྱས་པའི་མདའ་དང་།
en: He should erect, upon golden rings, sixty-four arrows and banners of various bright colors.

source: ནོར་བུའི་ཕྲེང་བ་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་དཀྱིལ་འཁོར་བརྒྱན་པར་བྱའོ།
en: He should further adorn the outer circumference of the maṇḍala with many kinds of jewels strung upon threads. “

source: །དེ་ནས་ཕྱི་རོལ་གྱི་དཀྱིལ་འཁོར་ཐོག་ཐག་ཏུ་ས་དང་བསྲེས་པའི་བའི་ལྕི་བས་དཀྱིལ་འཁོར་བྱས་ལ་དྲི་ཆབ་ཀྱིས་བསྐུས་ཏེ། ཚོན་སྣ་ལྔའི་སྲད་བུས་ཐིག་བཏབ་ལ་སྒོ་བཞི་རྣམ་པར་ཕྱེ་སྟེ།
en: Then, outside the maṇḍala, the vidyā holder should prepare an outer zone made of clay and cow dung and daubed on the surface with perfumed water and five-colored chaff.

source: སེང་ལྡེང་གི་ཕུར་བུ་ཚད་སོར་བཅུ་གཉིས་པ་དྲུག་ཅུ་རྩ་བཞི་གདབ་བོ།
en: He should demarcate four doors using a cord and then drive sixty-four stakes of cutch wood, twelve fingers long, into the ground.

source: །ཚོན་སྣ་ལྔའི་སྲད་བུས་དཀྱིལ་འཁོར་ཀུན་དུ་བསྐོར་བར་བྱའོ།
en: By stretching a five-colored thread around them, he should thus demarcate the outer periphery.

source: །བུམ་བུ་དང་། བུམ་པ་དང་། བྱམ་བུམ་དྲུག་ཅུ་རྩ་བཞི་གཏོར་མ་སྣ་ཚོགས་ཀྱིས་བཀང་པ་གཞག་གོ།
en: He should place sixty-four pots, jars, and pitchers there, as well as sixty-four earthenware bowls and water jars, all filled with various bali offerings.

source: །ཁོམ་ཕོར་ཟླུམ་པོ་དྲུག་ཅུ་རྩ་བཞི་གཏོར་མ་སྣ་ཚོགས་ཀྱིས་བཀང་པ་གཞག་གོ། །གཏོར་མ་ཚུལ་སྣ་ཚོགས་པ་དྲུག་ཅུ་རྩ་བཞི་སོ་སོར་གཞག་གོ།
en: In each of the sixty-four vessels in each group of sixty-four, he should place bali articles of various kinds.

source: །སྣོད་ཚོན་སྣ་ལྔ་པ་དྲུག་ཅུ་རྩ་བཞི་ཁ་ཟས་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བཀང་པ་དང་། བཅའ་བ་རྣམ་པ་སྣ་ཚོགས་བླུགས་པ་དང་།
en: The groups of sixty-four vessels should be of five different colors and be filled completely.

source: གཏོར་མ་དཀར་པོ་རྣམ་པ་སྣ་ཚོགས་གཞག་གོ།
en: The vidyā holder should offer various white bali foods arranged according to their types. “

source: །ཡོ་བྱད་ཐམས་ཅད་ཀྱིས་ཡོངས་སུ་གང་བ། རོ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་གཏོར་མ་གཞག་གོ།
en: The bali should be complete with all the required paraphernalia and consist of various flavors.

source: །འབྲས་བུ་སྣ་ཚོགས་དང་། མེ་ཏོག་སྣ་ཚོགས་དགྲམ་མོ། །ཕྲེང་བ་བརྒྱ་ཉི་ཤུ་རྩ་གཅིག་དཀྱིལ་འཁོར་དུ་དཔྱང་བར་བྱ་སྟེ།
en: The area should be strewn with various fruits and flowers.

source: བྱང་ཕྱོགས་ཀྱི་དཀྱིལ་འཁོར་ལ་དྲུག་ཅུ་རྩ་བཞི་སྙིང་པོའི་དཀྱིལ་འཁོར་ལ་སུམ་ཅུ་རྩ་གཉིས་གདགས་སོ།
en: The vidyā holder should place one hundred and twenty-one garlands in the area around the bali: sixty-four in the outlying area and thirty-two in the inner area.

source: །མེ་མར་གྱི་སྡོང་བུ་བཞི་བུད་བར་བྱའོ། །གཏོར་མ་བརྒྱ་དྲུག་ཅུ་རྩ་བཞི་དང་དཀྱིལ་འཁོར་ཐོག་ཐག་ཏུ་མར་མེ་བུད་པར་བྱའོ། །ཆང་དང་ཤ་དང་།
en: He should light four lanterns in the inner area and one hundred and sixty-four lamps throughout the bali area.

source: བེག་བཙོང་དང་། སྒོག་སྐྱ་དང་། ཀེའུ་དང་། ཚོད་སྔོན་དང་། ལ་ཕུག་སྤངས་པའི་གཏོར་མ་གཞན་རྣམ་པ་སྣ་ཚོགས་གཞག་པར་བྱའོ།
en: He should avoid offering alcohol, meat, onions, garlic, red onions, unripe vegetables, or roots and instead offer a bali of various other ingredients. “

source: །དཀྱིལ་འཁོར་གྱི་ཕྱི་རོལ་གྲྭ་བཞིར་དོན་ཡོད་པའི་ཞགས་པའི་མདོ་སྡེ་བཀླག་པར་བྱའོ། །སྒོ་རེ་རེར་བཅོམ་ལྡན་འདས་མ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་བཀླག་པར་བྱའོ། །ཆོས་ཀློག་པ་ལེགས་པར་ཁྲུས་བྱས་ཏེ།
en: He should read aloud the Amogha­pāśa Sūtra at each of the four corners outside the maṇḍala and read the blessed Prajñāpāramitā at each of the doors.

source: ལྷ་རྫས་ཀྱི་གོས་ཀྱིས་དཀྲིས་ཏེ།
en: Each time, he should prepare a seat that is well adorned and covered in divine cloth.

source: གཙང་མ་ལ་དྲི་རྣམ་པ་སྣ་ཚོགས་ཀྱིས་བསྒོས་པའི་གོས་གཙང་མ་སར་པ་བགོས་ཏེ།
en: Ritually pure and thoroughly bathed, he should speak according to the Dharma, perfume himself with various fragrances, and wear clean new clothes.

source: ཆོས་ཀྱི་སྟན་ཤིན་ཏུ་བརྒྱན་པ་ལྷ་རྫས་ཀྱི་སྟན་ལ་འདུག་ནས་ཚིག་འཇམ་པོ་ཚིག་མཉེན་པོས་བཀླག་པར་བྱའོ།
en: He should sit down on the divine seat and read each text in a voice as sweet and soft as can be.

source: །ནུབ་ཀྱི་ཕྱོགས་ཆ་ལ་དཀྱིལ་འཁོར་མཐོན་པོ་ལ་བདེ་བ་ཅན་གྱི་བཀོད་པ་བྲིས་པ་འོད་དཔག་མེད་དང་།
en: In the western quarter, on a raised circular dais, he should erect, facing the maṇḍala, an image of the magically arrayed realm of Sukhāvatī.

source: འཕགས་པ་སྤྱན་རས་གཟིགས་ཀྱི་དབང་ཕྱུག་དང་།
en: It should include an image of Amitābha, Noble Avalokiteśvara, and Mahā­sthāma­prāpta.

source: མཐུ་ཆེན་ཐོབ་པའི་གཟུགས་བྲི་བའི་རས་ཀྱི་སྐུ་གཟུགས་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་པར་གཞག་པར་བྱའོ། །ཤར་གྱི་ཕྱོགས་ཆ་ལ་དཀྱིལ་འཁོར་གྲྭ་བཞི་མཐོན་པོ་བྱས་ལ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་ལ་ཤཱཀྱ་ཐུབ་པ་དང་།
en: In the eastern quarter, on a raised quadrangular dais, he should erect a cloth painting with an image of Śākyamuni that faces the maṇḍala of liberation.

source: འཕགས་པ་རྡོ་རྗེ་འཆང་བ་དང་། དོན་ཡོད་པའི་ཞགས་པའི་ཁྲོ་བོའི་གཟུགས་བྲིས་པ་རས་ཀྱི་སྐུ་གཟུགས་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་པར་གཞག་གོ།
en: The painting should also include Noble Vajradhara and the wrathful form of Amoghapāśa.

source: །ལྷོའི་ཕྱོགས་ཆ་ལ་རི་འདྲ་བའི་གནས་མཐོན་པོ་བྱས་ལ་དེ་བཞིན་གཤེགས་པ་འཇིག་རྟེན་དབང་ཕྱུག་རྒྱལ་པོ་དང་། འཇམ་དཔལ་དང་། སྒྲིབ་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བ་དང་། དོན་ཡོད་པའི་ཞགས་པ་རས་ལ་བྲིས་པའི་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་པར་གཞག་གོ།
en: In the southern quarter, on a raised dais shaped like a mountain, he should erect a cloth painting of Amoghapāśa that faces the maṇḍala. The painting should also include the Tathāgata Lokendrarāja, Mañjuśrī, and Sarva­nivaraṇa­viṣkambhin.

source: །བྱང་གི་ཕྱོགས་ཆ་ལ་ཁྲོ་བོའི་རྒྱལ་པོ་དང་།
en: In the northern quarter, he should erect a painting of Krodharāja that faces the maṇḍala.

source: དེ་བཞིན་གཤེགས་པ་རྣམ་པར་སྣང་མཛད་དང་། བྱམས་པ་དང་།
en: The painting should also include the Tathāgata Vairocana, Maitreya, and Kṣitigarbha.

source: སའི་སྙིང་པོ་བྲིས་པའི་རས་ཀྱི་སྐུ་གཟུགས་དཀྱིལ་འཁོར་ལ་མངོན་དུ་ཕྱོགས་པར་གཞག་གོ། །སྟེགས་བུའི་རྣམ་པར་མཐོན་པོར་བྱས་པ་ཐམས་ཅད་ལེགས་པར་བརྒྱན་པར་བྱའོ། །དར་གྱི་ཕྲེང་བས་བརྒྱན་པར་བྱའོ། །རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ་དང་། བུམ་པ་གང་བ་གཞག་པ་དང་།
en: They should all be upon daises shaped as described, seated on seats decorated with silk streamers and garlands, and adorned with all ornaments. “

source: དྲིས་དཀྱིལ་འཁོར་བྱ་བ་དང་།
en: He should place a full jar in front of each of the paintings and prepare a perfumed area around them.

source: རོའི་མཆོག་རྣམ་པ་སྣ་ཚོགས་བཟའ་བའི་ངོ་བོ་རྣམ་པ་དུ་མའི་ཁ་ཟས་ཀྱི་རོ་འབུལ་བ་དང་། འབྲས་བུ་རྣམ་པ་སྣ་ཚོགས་དང་ལྡན་པའི་བསོད་སྙོམས་གཞག་པ་དང་། ཙནྡན་དང་། ཨ་ག་རུ་དང་། དུ་རུསྐ་དང་།
en: He should offer ‘white’ food and drink, of various types, that have been prepared according to various recipes and are of various superb flavors, and he should include various fruits and piles of alms food.

source: ག་བུར་དང་། གླ་རྩི་དང་། གུར་གུམ་དང་བསྲེས་པའི་བདུག་པ་རས་ཀྱི་སྐུ་གཟུགས་ལ་དབུལ་བར་བྱའོ།
en: In front of each painting he should burn incense consisting of a mixture of sandalwood, agarwood, olibanum, camphor, musk, and saffron.

source: །དེ་ནས་རིག་སྔགས་འཆང་བས་དུས་གསུམ་དུ་ཁྲུས་བྱ་ཞིང་། གོས་ལན་གསུམ་བརྗེས་ཏེ།
en: He should bathe at the three junctions of the day, changing his clothes each time.

source: དུས་གསུམ་དུ་བཟླས་བརྗོད་དང་ཆོ་ག་བྱའོ། །ཚེས་བརྒྱད་ནས་བརྩམས་ཏེ་ཚེས་བཅོ་ལྔ་ཚང་གི་བར་དུ་དོན་ཡོད་པའི་ཞགས་པ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱའོ། །ཁྲོ་བོའི་རྒྱལ་པོ་ལན་ཉི་ཤུ་རྩ་གཅིག་བཟླས་བརྗོད་བྱའོ། །དོན་ཡོད་པའི་ཞགས་པའི་ལྕགས་ཀྱུ་ཉི་ཤུ་རྩ་གཅིག་དང་།
en: He should recite the mantra and offer homa according to procedure at the three junctions of the day, from the eighth to the fifteenth lunar day, the day of the full moon. “

source: དོན་ཡོད་པ་རྣམ་པར་ལྟ་བའི་ཞགས་པའི་སྙིང་པོ་དང་འཇིག་རྟེན་ལས་འདས་པ་རྣམ་པར་འཕྲུལ་པ་ལན་ཉི་ཤུ་རྩ་གཅིག་དང་།
en: He should recite the mantra of Amoghapāśa twenty-one times, consecrate himself with the mantra of Krodharāja twenty-one times, recite the mantra of Amogha­pāśāṅkuśa twenty-one times, and recite the heart mantra of Amoghavilokita­pāśa, which produces supramundane results, twenty-one times.

source: རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་པ་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱ་བ་དང་། རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་གྱི་ཞགས་པའི་སྙིང་པོ་སྟོང་རྩ་བརྒྱད་བཟླས་བརྗོད་བྱའོ།
en: He should recite the maṇḍala of liberation that is revered by all the bodhisattvas one thousand and eight times and recite the heart mantra of the noose-like maṇḍala of liberation the same number of times.

source: །ཟླ་བ་ཉ་ལ་ཐུག་གི་བར་དུ་ཟས་དཀར་གསུམ་བཟའ་བར་བྱའོ།
en: He should restrict his diet to the three ‘white’ foods up until the fifteenth lunar day, the day of the full moon. “

source: །ཚེས་བཅོ་ལྔའི་ཉིན་མཚན་ཐོག་ཐག་ཏུ་དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་དཔག་ཏུ་མེད་པར་བཟླས་བརྗོད་བྱའོ།
en: On the fifteenth day, he should recite the heart mantra of Amoghapāśa all day and all night without counting.

source: །མཚན་ཐོག་ཐག་བཟླས་བརྗོད་བྱས་ཀྱང་ངལ་བ་མེད་པ་དང་། ལུས་སྙོམ་པ་དང་བྲལ་བས་བཟླས་བརྗོད་བྱའོ།
en: He should recite all night, ignoring fatigue and physical exhaustion.

source: །བྱམས་པ་དང་། སྙིང་རྗེའི་ལྷག་པའི་བསམ་པའི་སེམས་སུ་བྱའོ་བཟླས་བརྗོད་ཀྱི་ཆོ་ག་ཟིན་ནས་དཀྱིལ་འཁོར་གྱི་བྱ་བ་མཚམས་བཅད་པ་དང་།
en: While reciting, he should harbor the heartfelt sentiment of love and compassion.

source: ཕྱོགས་བཅིང་བ་དང་། བདག་སྲུང་བ་དང་། གཞན་སྲུང་བ་དང་དཀྱིལ་འཁོར་བསྡམ་པ་བྱས་ནས། དེ་ནས་འཁོར་རྣམས་དཀྱིལ་འཁོར་དུ་དམ་ཚིག་ལ་གཞུག་པར་བྱའོ།
en: When he has completed the recitation procedure, he should perform the rites associated with the maṇḍala: namely, the rites for creating the boundary, binding the directions, self-protection, protection of others, and binding the maṇḍala.

source: །དཀྱིལ་འཁོར་དུ་གཞུག་པ་དང་།
en: He should then cause his assistants to enter the samaya maṇḍala.

source: དཀྱིལ་འཁོར་གྱི་ལས་ཟིན་ནས་མཆོད་པ་བརྩམ་མོ།
en: When the rites of entering the maṇḍala are completed, he should make offerings.

source: །མཆོད་པའི་ཆོ་ག་ཟིན་པ་དང་། དེ་ནས་བཟླས་བརྗོད་བརྩམ་པར་བྱ་སྟེ།
en: After completing the offerings’ procedure, he should recite the mantra. “

source: དོན་ཡོད་པའི་ཞགས་པའི་དཀྱིལ་འཁོར་གྱི་སྤྱན་སྔར་འདུག་ནས། དོན་ཡོད་པའི་ཞགས་པའི་སྙིང་པོ་བཟླས་བརྗོད་བྱས་ལ། ཁྲོ་བོའི་རྒྱལ་པོ་བརྒྱ་རྩ་བརྒྱད་ཀྱིས་དབང་བསྐུར་རོ། །བཟླས་བརྗོད་ལན་ཉི་ཤུ་རྩ་གཅིག་དང་། དབང་བསྐུར་མ་ཐག་ཏུ་རས་ཀྱི་སྐུ་གཟུགས་དང་།
en: Facing the maṇḍala of Amoghapāśa, he should recite the heart mantra of Amoghapāśa one hundred and eight times and then consecrate the painting twenty-one times with the mantra of Krodharāja.

source: དཀྱིལ་འཁོར་ཐམས་ཅད་ཀུན་ཏུ་འབར་ཞིང་འོད་ཟེར་སྣ་ཚོགས་འབྱིན་ཅིང་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་འབྱིན་པར་འགྱུར་རོ།
en: Once consecrated by reciting the mantra, the entire surface of the cloth maṇḍala will blaze with light, and light of various colors will radiate in all directions. The word ‘good!’

source: །རིག་སྔགས་འཆང་བའི་སྙིང་དགའ་ཞིང་ལུས་འབར་བར་འགྱུར་རོ།
en: will be heard, the vidyā holder will be thrilled with joy, and his body will emit light.

source: །འཕགས་པ་སྤྱན་རས་གཟིགས་དབང་ཕྱུག་ཤིན་ཏུ་འབར་ཞིང་འོད་འཕྲོ་བ་ཉི་མ་སྟོང་བས་ལྷག་པའི་འོད་ཟེར་ཅན་དོན་ཡོད་པའི་ཞགས་པ་ཚངས་པའི་ཆ་བྱད་འཆང་བ་དཀྱིལ་འཁོར་གྱི་དབུས་ཀྱི་ནང་ནས་མངོན་དུ་གཤེགས་ཏེ།
en: Noble Avalokiteśvara will emerge from the center of the maṇḍala in his natural form, blazing with a light brighter than a hundred thousand suns.

source: ཕྱོགས་བཅུའི་དཀྱིལ་འཁོར་ཀུན་ལ་རྣམ་པར་གཟིགས་ཤིང་རིག་སྔགས་འཆང་བ་ལེགས་སོ་ཞེས་བྱ་བའི་སྒྲ་ཕྱུང་སྟེ།
en: He will appear in his great form of Amoghapāśa, look at the entire maṇḍala—both its main and the intermediate quarters—and applaud the vidyā holder.

source: ཕྱག་གཡས་པ་བརྐྱང་སྟེ་རིག་སྔགས་འཆང་བའི་སྤྱི་བོ་ལ་བཞག་སྟེ།
en: Extending his right arm, he will place his right hand on the vidyā holder’s head and say, ‘Good! It is good, vidyā holder!

source: དཀྱིལ་འཁོར་གྱི་མཆོག་ཤིན་ཏུ་བརྒྱན་ཅིང་སྤྲས་པ་འདི་ནི་ཤིན་ཏུ་བཟང་བ་ཡིན་ཏེ། ལེགས་སོ་ལེགས་སོ།
en: This maṇḍala is most beautiful; it is well adorned and beautifully decorated.

source: །འདི་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་དོན་ཡོད་པའི་ཞགས་པ་རྣམ་པར་འཕྲུལ་པ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་བྱིན་གྱིས་བརླབས་པ། བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་པ་དེ་བཞིན་གཤེགས་པ་དང་།
en: It is a maṇḍala of liberation that constitutes a miraculous manifestation of Amoghapāśa, and it is blessed by all tathāgatas and revered by all bodhisattvas.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་གསང་བ། ལྷ་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་།
en: It is the secret maṇḍala of all tathāgatas and bodhisattvas, and it is the samaya maṇḍala of all devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, and rākṣasas.

source: སྲིན་པོ་རྣམས་ཀྱི་དམ་ཚིག་གི་དཀྱིལ་འཁོར་བདུད་ཐམས་ཅད་ཕམ་པར་བྱེད་པའི་དཀྱིལ་འཁོར་བགེགས་དང་། རྣམ་པར་ལོག་འདྲེན་ཐམས་ཅད་འཇོམས་པ། བུད་མེད་དང་། སྐྱེས་པ་དང་། ཁྱེའུ་དང་། བུ་མོ་དང་། དགེ་སྦྱོང་དང་། བྲམ་ཟེ་དང་། རྗེའུའི་རིགས་དང་། དམངས་རིགས་དང་། ཐ་ན་བྱོལ་སོང་གི་སྐྱེ་གནས་སུ་གཏོགས་པའི་བྱའང་རུང་སྟེ། སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་གཅོང་རོང་ལས་སྒྲོལ་བ་ཡིན་ནོ། །འདི་ནི་སྡིག་པ་དང་། སྒྲིབ་པ་ཐམས་ཅད་དང་། དམྱལ་བ་དང་།
en: It is a maṇḍala that ensures victory over all māras, destroys all vighnas and vināyakas, and pulls all beings—women, men, boys, girls, monks, brahmins, kṣatriyas, vaiśyas, and śūdras, all the way down to animals and birds—out of the wasteland of saṃsāra.

source: སྡུག་བསྔལ་དང་། ནད་དང་། སྐྱེ་བ་དང་། རྒ་བ་དང་། འཆི་བ་ལས་ཡོངས་སུ་ཐར་བར་བྱེད་ཅིང་འཇིགས་པ་མེད་པའི་ཁྱིམ་དུ་འཇུག་པར་བྱེད་པ་ཡིན་ནོ།
en: This maṇḍala delivers you from all evil, obscurations, and the sufferings of hell, disease, birth, old age, and death, and it ensures entry into the city of fearlessness. “ ‘

source: །འདི་ནི་རྣམ་པར་ཐར་པར་བྱེད་པ་དཀྱིལ་འཁོར་ཆེན་པོ་སྙིང་པོ་དང་།
en: This great maṇḍala and its heart mantra bring salvation.

source: གསང་སྔགས་སུ་བཅས་པ་རྣམ་པར་གྲོལ་བའི་དཀྱིལ་འཁོར་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱིས་ཕྱག་བྱས་པ་འདི་རིག་སྔགས་འཆང་བ་དེ་དང་དེས་མིང་བརྗོད་པ་དང་། གང་དྲན་པ་ཙམ་ལ་སོགས་པ་དང་། ལྟ་བ་དང་། ཉན་པ་དང་། མིང་འཛིན་པ་ཡང་འཁོར་བའི་ཕ་རོལ་ཏུ་རྒལ་བར་འགྱུར་རོ།
en: For this reason, vidyā holder, it is called the maṇḍala of liberation revered by all bodhisattvas.

source: །ཕྱིར་མི་ལྡོག་པ་ཉིད་དུ་ས་བཅུ་བགྲོད་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཐོབ་པར་འགྱུར་རོ། །དེ་གང་ཞེ་ན། གང་ཞིག་དཀྱིལ་འཁོར་ཆེན་པོ་འདི་འདྲ་བ་མངོན་དུ་མཐོང་བ་དང་། རྣམ་པར་གྲོལ་བའི་གཟུངས་འཇིག་རྟེན་ལས་འདས་པའི་གསང་སྔགས་ཀྱི་ཚིག་བཟླས་བརྗོད་བྱེད་པ་དང་། ཀློག་པ་དང་། དྲན་པ་དང་། འཆད་པ་དང་། ལན་འགའ་སྨྱུར་བས་མཐོང་བ་དང་།
en: If someone who merely recollects it, sees it, hears it, or learns its name can reach the distant shore of saṃsāra, reach the point of no return on the path to awakening, progress toward the tenth bodhisattva level, and attain perfect awakening, what need is there to mention someone who looks directly at this great maṇḍala, recites the supramundane mantra-words of this dhāraṇī of liberation, studies them, memorizes them, and explains them, or someone who gazes at it during a fast, even for a brief moment.
